In [2]:
import pandas as pd
import numpy as np
import sqlite3

pd.set_option('display.max_columns', None)

## Step 1: Load Orders Data (CSV)

The `orders.csv` file contains transactional data for all food delivery orders.
This dataset will act as the base table for all further joins.

In [6]:
# Load orders transactional data
orders_df = pd.read_csv("orders.csv")

# Display first 5 rows
orders_df.head()

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name
0,1,2508,450,18-02-2023,842.97,New Foods Chinese
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian

In [8]:
# Check structure of orders data
orders_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   order_id         10000 non-null  int64
 1   user_id          10000 non-null  int64
 2   restaurant_id    10000 non-null  int64
 3   order_date       10000 non-null  object
 4   total_amount     10000 non-null  float64
 5   restaurant_name  10000 non-null  object
dtypes: float64(1), int64(3), object(2)
memory usage: 468.9+ KB

## Step 2: Load Users Data (JSON)

The `users.json` file contains user master information such as city and membership type.
This data will be joined with orders using `user_id`.

In [10]:
# Load users master data
users_df = pd.read_json("users.json")

# Display first 5 rows
users_df.head()

   user_id    name       city membership
0        1  User_1    Chennai    Regular
1        2  User_2       Pune       Gold
2        3  User_3  Bangalore       Gold
3        4  User_4  Bangalore    Regular
4        5  User_5       Pune       Gold

In [12]:
# Check structure of users data
users_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3000 entries, 0 to 2999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   user_id     3000 non-null   int64
 1   name        3000 non-null   object
 2   city        3000 non-null   object
 3   membership  3000 non-null   object
dtypes: int64(1), object(3)
memory usage: 93.9+ KB

## Step 3: Load Restaurant Data (SQL)

The `restaurants.sql` file contains restaurant master data.
This data is loaded into a SQLite database and then read into a pandas DataFrame.

In [18]:
# Create a SQLite database connection
conn = sqlite3.connect("restaurants.db")
cursor = conn.cursor()

# Read and execute SQL file
with open("restaurants.sql", "r", encoding="utf-8") as file:
    sql_script = file.read()

cursor.executescript(sql_script)
conn.commit()

In [26]:
# Load resturants data into Dataframe
restaurants_df = pd.read_sql("SELECT * FROM restaurants", conn)

# Display first 5 rows
restaurants_df.head()

   restaurant_id restaurant_name  cuisine  rating
0              1    Restaurant_1  Chinese     4.8
1              2    Restaurant_2   Indian     4.1
2              3    Restaurant_3  Mexican     4.3
3              4    Restaurant_4  Chinese     4.1
4              5    Restaurant_5  Chinese     4.8

In [28]:
# Check structure of restaurant data
restaurants_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   restaurant_id    500 non-null    int64
 1   restaurant_name  500 non-null    object
 2   cuisine          500 non-null    object
 3   rating           500 non-null    float64
dtypes: float64(1), int64(1), object(2)
memory usage: 15.8+ KB

## Step 4: Data Merging (Left Join)

All datasets are merged using LEFT JOIN to ensure that every order is retained
even if corresponding user or restaurant details are missing.

Join Keys:
- orders.user_id → users.user_id
- orders.restaurant_id → restaurants.restaurant_id

In [30]:
# Merge orders with users (LEFT JOIN)
orders_users_df = pd.merge(
    orders_df,
    users_df,
    on="user_id",
    how="left"
)

# Preview merged data
orders_users_df.head()

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name,name,city,membership
0,1,2508,450,18-02-2023,842.97,New Foods Chinese,User_2508,Hyderabad,Regular
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine,User_2693,Pune,Regular
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi,User_2084,Chennai,Gold
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg,User_319,Bangalore,Gold
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian,User_1064,Pune,Regular

In [38]:
# Merge with restaurant data (LEFT JOIN)
final_df = pd.merge(
    orders_users_df,
    restaurants_df,
    on="restaurant_id",
    how="left"
)

# Preview final dataset
final_df.head()

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name_x,name,city,membership,restaurant_name_y,cuisine,rating
0,1,2508,450,18-02-2023,842.97,New Foods Chinese,User_2508,Hyderabad,Regular,Restaurant_450,Mexican,3.2
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine,User_2693,Pune,Regular,Restaurant_309,Indian,4.5
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi,User_2084,Chennai,Gold,Restaurant_107,Mexican,4.0
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg,User_319,Bangalore,Gold,Restaurant_224,Chinese,4.8
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian,User_1064,Pune,Regular,Restaurant_293,Italian,3.0

In [34]:
# Check final dataset structure
final_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   order_id           10000 non-null  int64
 1   user_id            10000 non-null  int64
 2   restaurant_id      10000 non-null  int64
 3   order_date         10000 non-null  object
 4   total_amount       10000 non-null  float64
 5   restaurant_name_x  10000 non-null  object
 6   name               10000 non-null  object
 7   city               10000 non-null  object
 8   membership         10000 non-null  object
 9   restaurant_name_y  10000 non-null  object
 10  cuisine            10000 non-null  object
 11  rating             10000 non-null  float64
dtypes: float64(2), int64(3), object(7)
memory usage: 937.6+ KB

In [40]:
# Save final dataset to CSV
final_df.to_csv("final_food_delivery_dataset.csv", index=False)

print("final_food_delivery_dataset.csv saved successfully")

final_food_delivery_dataset.csv saved successfully

## Step 5: Initial Data Validation

Before analysis, we validate the final dataset to understand its size,
columns, and basic statistics.

In [42]:
#Dataset Shape
final_df.shape

(10000, 12)

In [44]:
# List all columns
final_df.columns

Index(['order_id', 'user_id', 'restaurant_id', 'order_date', 'total_amount',
       'restaurant_name_x', 'name', 'city', 'membership', 'restaurant_name_y',
       'cuisine', 'rating'],
      dtype='object')

In [46]:
# Summary statistics for numerical columns
final_df.describe()

          order_id       user_id  restaurant_id  total_amount        rating
count  10000.00000  10000.000000   10000.000000  10000.000000  10000.000000
mean    5000.50000   1504.117700     251.016700    801.162412      4.045430
std     2886.89568    861.727776     144.622558    405.458753      0.606531
min        1.00000      1.000000       1.000000    100.200000      3.000000
25%     2500.75000    761.000000     127.000000    446.310000      3.500000
50%     5000.50000   1508.000000     251.000000    806.295000      4.100000
75%     7500.25000   2250.250000     376.000000   1149.227500      4.600000
max    10000.00000   3000.000000     500.000000   1499.830000      5.000000

In [52]:
# Total revenue from Gold members by city
final_df[final_df["membership"] == "Gold"] \
    .groupby("city")["total_amount"] \
    .sum() \
    .sort_values(ascending=False)

city
Chennai      1080909.79
Pune         1003012.32
Bangalore     994702.59
Hyderabad     896740.19
Name: total_amount, dtype: float64

In [54]:
# Average order value by cuisine
final_df.groupby("cuisine")["total_amount"] \
    .mean() \
    .sort_values(ascending=False)

cuisine
Mexican    808.021344
Italian    799.448578
Indian     798.466011
Chinese    798.389020
Name: total_amount, dtype: float64

In [56]:
# Count of users with total order value greater than 1000
user_totals = final_df.groupby("user_id")["total_amount"].sum()
user_totals[user_totals > 1000].count()

2544

In [58]:
# Revenue by restaurant rating range
bins = [3.0, 3.5, 4.0, 4.5, 5.0]
labels = ["3.0–3.5", "3.6–4.0", "4.1–4.5", "4.6–5.0"]

final_df["rating_range"] = pd.cut(final_df["rating"], bins=bins, labels=labels)

final_df.groupby("rating_range")["total_amount"] \
    .sum() \
    .sort_values(ascending=False)

C:\Users\Kiran T\AppData\Local\Temp\ipykernel_23212\2425537201.py:7: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  final_df.groupby("rating_range")["total_amount"] \

rating_range
4.6–5.0    2197030.75
4.1–4.5    1960326.26
3.0–3.5    1881754.57
3.6–4.0    1717494.41
Name: total_amount, dtype: float64

In [62]:
# Restaurant count and revenue by cuisine
pd.DataFrame({
    "restaurant_count": final_df.groupby("cuisine")["restaurant_id"].nunique(),
    "total_revenue": final_df.groupby("cuisine")["total_amount"].sum()
}).sort_values("restaurant_count")

         restaurant_count  total_revenue
cuisine
Chinese               120     1930504.65
Indian                126     1971412.58
Italian               126     2024203.80
Mexican               128     2085503.09

In [64]:
# Percentage of orders placed by Gold members
round(
    (final_df[final_df["membership"] == "Gold"].shape[0] / final_df.shape[0]) * 100
)

50

In [66]:
# Restaurants with fewer than 20 orders and highest average order value
final_df.groupby("restaurant_name_y") \
    .agg(
        avg_order_value=("total_amount", "mean"),
        order_count=("order_id", "count")
    ) \
    .query("order_count < 20") \
    .sort_values("avg_order_value", ascending=False)

                   avg_order_value  order_count
restaurant_name_y
Restaurant_294         1040.222308           13
Restaurant_262         1029.473333           18
Restaurant_77          1029.180833           12
Restaurant_193         1026.306667           15
Restaurant_7           1002.140625           16
...                            ...          ...
Restaurant_184          621.828947           19
Restaurant_498          596.815556           18
Restaurant_192          589.972857           14
Restaurant_329          578.578667           15
Restaurant_300          572.686471           17

[241 rows x 2 columns]

In [80]:
# Map top restaurant ID to actual restaurant name
final_df[final_df["restaurant_name_y"] == "Restaurant_7"][
    ["restaurant_name_x", "restaurant_name_y"]
].drop_duplicates()

       restaurant_name_x restaurant_name_y
8  Ruchi Biryani Punjabi      Restaurant_7

In [68]:
# Revenue by membership and cuisine combination
final_df.groupby(["membership", "cuisine"])["total_amount"] \
    .sum() \
    .sort_values(ascending=False)

membership  cuisine
Regular     Mexican    1072943.30
            Italian    1018424.75
Gold        Mexican    1012559.79
            Italian    1005779.05
Regular     Indian      992100.27
Gold        Indian      979312.31
            Chinese     977713.74
Regular     Chinese     952790.91
Name: total_amount, dtype: float64

In [70]:
# Quarterly revenue analysis
final_df["order_date"] = pd.to_datetime(final_df["order_date"])
final_df["quarter"] = final_df["order_date"].dt.to_period("Q")

final_df.groupby("quarter")["total_amount"] \
    .sum() \
    .sort_values(ascending=False)

C:\Users\Kiran T\AppData\Local\Temp\ipykernel_23212\1124115717.py:2: UserWarning: Parsing dates in %d-%m-%Y format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  final_df["order_date"] = pd.to_datetime(final_df["order_date"])

quarter
2023Q3    2037385.10
2023Q4    2018263.66
2023Q1    1993425.14
2023Q2    1945348.72
2024Q1      17201.50
Freq: Q-DEC, Name: total_amount, dtype: float64

## numerical question and answers

In [92]:
# Total number of orders by Gold members
final_df[final_df["membership"] == "Gold"].shape[0]

4987

In [94]:
# Total revenue generated from Hyderabad city
round(
    final_df[final_df["city"] == "Hyderabad"]["total_amount"].sum()
)

1889367

In [96]:
# Count of distinct users
final_df["user_id"].nunique()

2883

In [98]:
# Average order value for Gold members
round(
    final_df[final_df["membership"] == "Gold"]["total_amount"].mean(),
    2
)

797.15

In [100]:
# Orders placed for restaurants with rating >= 4.5
final_df[final_df["rating"] >= 4.5].shape[0]

3374

In [104]:
# Identify top revenue city among Gold members
top_gold_city = (
    final_df[final_df["membership"] == "Gold"]
    .groupby("city")["total_amount"]
    .sum()
    .sort_values(ascending=False)
    .index[0]
)

top_gold_city

# Number of orders placed in that city by Gold members
final_df[
    (final_df["membership"] == "Gold") &
    (final_df["city"] == top_gold_city)
].shape[0]

1337

## Fill in the blanks

In [106]:
final_df.shape[0]

10000